# 7.1 处理缺失数据

In [2]:
import pandas as pd
import numpy as np

In [3]:
string_data = pd.Series(['aardvark', 'artichoke', np.nan, 'avocado'])

In [4]:
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [5]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [6]:
# python内置的None值，在对象数组中也可以作为NA

string_data[0] = None

In [7]:
string_data

0         None
1    artichoke
2          NaN
3      avocado
dtype: object

In [8]:
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

In [11]:
%%html
<img src="picture/表7-1 NA处理方法.png", width=600>

## 7.1.1 滤除缺失数据

In [12]:
import numpy as np
import pandas as pd
from numpy import nan as NA

In [13]:
# instance.dropna(): 对一个Series, dropna返回一个仅含非空数据和索引值的Series

data = pd.Series([1, NA, 3.5, NA, 7])

In [14]:
# 对于一个 Series, dropna 返回一个仅含非空数据和索引值的 Series
# 等价于 data[data.notnull()]

data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [15]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [17]:
# 对于DataFrame对象，dropna默认丢弃任何含有缺失值的行

data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA], [NA, NA, NA], [NA, 6.5, 3.]])
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [19]:
# 丢弃任何含有缺失值的【行】

cleaned = data.dropna()
cleaned

     0    1    2
0  1.0  6.5  3.0

In [20]:
# 传入how='all'，将只丢弃全为NA的行

data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [21]:
# axis=1: 丢弃【列】

data[4] = NA
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [22]:
data.dropna(axis=1, how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [23]:
# 另一个滤除DataFrame行的问题涉及时间序列数据
# thresh参数：只留下一部分观测数据

df = pd.DataFrame(np.random.randn(7, 3))

In [24]:
df.iloc[ : 4, 1] = NA

In [25]:
df.iloc[ : 2, 2] = NA

In [26]:
df

          0         1         2
0  1.356377       NaN       NaN
1 -0.398366       NaN       NaN
2 -0.729010       NaN  0.204286
3 -0.880182       NaN  0.129907
4 -0.258030  0.145700 -0.404247
5  1.678629 -1.325971  1.444727
6 -0.275759 -2.257442  1.139499

In [28]:
# dropna 默认丢弃任何含有缺失值的行

df.dropna()

          0         1         2
4 -0.258030  0.145700 -0.404247
5  1.678629 -1.325971  1.444727
6 -0.275759 -2.257442  1.139499

In [29]:
df.dropna(thresh=2)

          0         1         2
2 -0.729010       NaN  0.204286
3 -0.880182       NaN  0.129907
4 -0.258030  0.145700 -0.404247
5  1.678629 -1.325971  1.444727
6 -0.275759 -2.257442  1.139499

# 7.1.2 填充缺失数据

In [31]:
import numpy as np
import pandas as pd

In [32]:
df = pd.DataFrame(np.random.randn(7, 3))
df.iloc[ : 4, 1] = NA
df.iloc[ : 2, 2] = NA
df

          0         1         2
0  0.530502       NaN       NaN
1  2.778961       NaN       NaN
2 -0.549434       NaN -0.283375
3 -0.550927       NaN -0.049192
4  0.620055 -0.070126  0.437446
5 -0.439721 -0.931624  0.561870
6  1.273925 -1.395134  0.444564

In [33]:
# instance.fillna()
# 通过一个常数调用fillna就会将缺失值替换为那个常数值

df.fillna(0)

          0         1         2
0  0.530502  0.000000  0.000000
1  2.778961  0.000000  0.000000
2 -0.549434  0.000000 -0.283375
3 -0.550927  0.000000 -0.049192
4  0.620055 -0.070126  0.437446
5 -0.439721 -0.931624  0.561870
6  1.273925 -1.395134  0.444564

In [34]:
# 通过【字典】调用fillna，可对不同的列填充不同的值

df.fillna({1: 0.5, 2: 1.5})

          0         1         2
0  0.530502  0.500000  1.500000
1  2.778961  0.500000  1.500000
2 -0.549434  0.500000 -0.283375
3 -0.550927  0.500000 -0.049192
4  0.620055 -0.070126  0.437446
5 -0.439721 -0.931624  0.561870
6  1.273925 -1.395134  0.444564

In [43]:
# fillna默认会返回新对象，但也可以对现有对象进行【就地修改】

df.fillna(0, inplace=True)

In [44]:
df

          0         1         2
0  0.530502  0.000000  0.000000
1  2.778961  0.000000  0.000000
2 -0.549434  0.000000 -0.283375
3 -0.550927  0.000000 -0.049192
4  0.620055 -0.070126  0.437446
5 -0.439721 -0.931624  0.561870
6  1.273925 -1.395134  0.444564

In [47]:
# 对 reindexing 有效的那些插值方法也可用于 fillna

df = pd.DataFrame(np.random.randn(6, 3))
df.iloc[2: , 1] = NA
df.iloc[4: , 2] = NA
df

          0         1         2
0  0.898754 -0.265359  2.175709
1 -0.247678  1.115069  0.566059
2 -0.697286       NaN  1.309175
3 -0.219983       NaN  2.112890
4 -0.015216       NaN       NaN
5  0.359647       NaN       NaN

In [48]:
# NaN前面一个值向下填充

df.fillna(method='ffill')

          0         1         2
0  0.898754 -0.265359  2.175709
1 -0.247678  1.115069  0.566059
2 -0.697286  1.115069  1.309175
3 -0.219983  1.115069  2.112890
4 -0.015216  1.115069  2.112890
5  0.359647  1.115069  2.112890

In [49]:
# limit=1: 向下填充一行

df.fillna(method='ffill', limit=1)

          0         1         2
0  0.898754 -0.265359  2.175709
1 -0.247678  1.115069  0.566059
2 -0.697286  1.115069  1.309175
3 -0.219983       NaN  2.112890
4 -0.015216       NaN  2.112890
5  0.359647       NaN       NaN

In [50]:
# 可以利用fillna实现许多别的功能
# 可以传入Series的平均值或中位数

data = pd.Series([1., NA, 3.5, NA, 7])
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [51]:
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

In [54]:
%%html
<img src="picture/表7-2 fillna函数参数.png", width=600>
<img src="picture/表7-2 fillna函数参数(2).png", width=600>

# 7.2 数据转换

## 7.2.1 移除重复数据

In [55]:
# DataFrame中出现重复行有多种原因

data = pd.DataFrame({'k1': ['one', 'two']*3 + ['two'],
                    'k2': [1, 1, 2, 3, 3, 4, 4]})
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [56]:
# isntance.duplicated(): 返回一个布尔型Series，表示各行是否是重复行（前面出现过的行）

data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [57]:
# instance.drop_duplicates(): 返回一个DataFrame，重复的数组会标为False

data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [58]:
# 这两种方法默认会判断全部列
# 也可以指定部分列进行重复项判断
# 假设是还有一列值，且只希望根据k1列过滤重复项

data['v1'] = range(7)
data

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

In [59]:
# 根据 k1 列过滤重复项

data.drop_duplicates(['k1'])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [60]:
# instance.duplicated() or drop_duplicates(): 默认保留第一个出现的值组合
# keep = 'last'：保留最后一个

data.drop_duplicates(['k1'], keep='last')

    k1  k2  v1
4  one   3   4
6  two   4   6

# 7.2.2 利用函数或映射进行数据转换

In [2]:
import numpy as np
import pandas as pd

In [3]:
data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon',
                             'Pastrami', 'corned beef', 'Bacon',
                             'pastrami', 'honey ham', 'nova lox'],
                    'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [4]:
# 添加一列表示该肉类食物来源的动物类型
# 先编写一个不同肉类到动物的映射

meat_to_animal = {
    'bacon': 'pig',
    'pulled pork': 'pig',
    'pastrami': 'cow',
    'corned beef': 'cow',
    'honey ham': 'pig',
    'nova lox': 'salmon'
}

In [5]:
# Series_instance.map(): 可以接受一个函数或含有映射关系的字典型对象
# Series_instance.str.lower(): 将各个值转换为小写

lowercased = data['food'].str.lower()
lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [69]:
data['animal'] = lowercased.map(meat_to_animal)
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [70]:
# 也可以传入一个能够完成全部这些工作的函数

data['food'].map(lambda x: meat_to_animal[x.lower()])

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

## 7.2.3 替换值

In [71]:
import numpy as np
import pandas as pd

In [72]:
# Series_instance.replaced()

data = pd.Series([1., -999., 2., -999., -1000., 3.])
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [73]:
data.replace(-999, np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [74]:
# 一次替换多个值

data.replace([-999, -1000], np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [75]:
# 让每个值有不同的替换值

data.replace([-999, -1000], [np.nan, 0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [76]:
# 也可以通过字典实现

data.replace({-999: np.nan, -1000: 0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [89]:
# Series_instance.replace() 与 Series_instance.str.replace() 不同
# Series_instance.str.replace(): 字符串的元素级替换

## 7.2.4 重命名轴索引

In [6]:
import numpy as np
import pandas as pd

In [7]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)),
                   index = ['Ohio', 'Colorado', 'New York'],
                   columns = ['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [12]:
transform = lambda x: x[ : 4].upper()

In [13]:
data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [14]:
# 将其赋值给index，实现对DataFrame的【就地修改】

data.index = data.index.map(transform)
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [15]:
# DataFrame_instance.rename(): 创建数据集的转换版（而不是修改原始数据）

# data.rename(index=str.title, columns=str.upper)

data.rename(index=str.upper, columns=str.title)

      One  Two  Three  Four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [86]:
# DataFrame.instance.rename(): 可结合字典型对象实现对【部分】轴标签的更新

data.rename(index={'OHIO': 'INDIANA'},
           columns={'three': 'peekaboo'})

         one  two  peekaboo  four
INDIANA    0    1         2     3
COLO       4    5         6     7
NEW        8    9        10    11

In [87]:
# inplace=True: 【就地修改】某个数据集

data.rename(index={'OHIO': 'INDIANA'}, inplace=True)
data

         one  two  three  four
INDIANA    0    1      2     3
COLO       4    5      6     7
NEW        8    9     10    11

# 7.2.5 离散化和面元划分

In [88]:
import numpy as np
import pandas as pd

In [89]:
# 假设你有一组人员数据，而你希望将它们划分为不同的年龄组

ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

In [90]:
# 划分为：18-25, 26-35, 36-60, 60-
# pandas.cut()

bins = [18, 25, 35, 60, 100]

In [91]:
cats = pd.cut(ages, bins)
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [92]:
cats.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [93]:
cats.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]],
              closed='right',
              dtype='interval[int64]')

In [94]:
# pd.value_counts(): 对值计数

pd.value_counts(cats)

(18, 25]     5
(35, 60]     3
(25, 35]     3
(60, 100]    1
dtype: int64

In [96]:
# 设置区间的开、闭端
# right=False: 修改【闭端】

pd.cut(ages, [18, 26, 36, 61, 100], right=False)

[[18, 26), [18, 26), [18, 26), [26, 36), [18, 26), ..., [26, 36), [61, 100), [36, 61), [36, 61), [26, 36)]
Length: 12
Categories (4, interval[int64]): [[18, 26) < [26, 36) < [36, 61) < [61, 100)]

In [97]:
# 传递一个列表或数组到labels,设置自己的面元名称

group_names = ['Youth', 'YoungAdult', 'MiddleAged', 'Senior']

In [98]:
cats = pd.cut(ages, bins, labels=group_names)
cats

[Youth, Youth, Youth, YoungAdult, Youth, ..., YoungAdult, Senior, MiddleAged, MiddleAged, YoungAdult]
Length: 12
Categories (4, object): [Youth < YoungAdult < MiddleAged < Senior]

In [99]:
pd.value_counts(cats)

Youth         5
MiddleAged    3
YoungAdult    3
Senior        1
dtype: int64

In [101]:
# 如果向cut传入的是面元的【数量】而不是确切的面元边界，则它会根据数据最小值和最大值计算等长面元

data = np.random.rand(20)

pd.cut(data, 4, precision=2)  # precision = 2: 限定小数只有两位

[(0.29, 0.52], (0.29, 0.52], (0.05, 0.29], (0.29, 0.52], (0.29, 0.52], ..., (0.52, 0.76], (0.29, 0.52], (0.29, 0.52], (0.05, 0.29], (0.52, 0.76]]
Length: 20
Categories (4, interval[float64]): [(0.05, 0.29] < (0.29, 0.52] < (0.52, 0.76] < (0.76, 0.99]]

In [102]:
# pd.qcut(): 可以根据样本【分位数】对数据进行面元划分

data = np.random.randn(1000)

In [103]:
cats = pd.cut(data, 4)
cats

[(-0.148, 1.417], (-1.714, -0.148], (-1.714, -0.148], (-3.286, -1.714], (-1.714, -0.148], ..., (1.417, 2.983], (-1.714, -0.148], (1.417, 2.983], (-1.714, -0.148], (-1.714, -0.148]]
Length: 1000
Categories (4, interval[float64]): [(-3.286, -1.714] < (-1.714, -0.148] < (-0.148, 1.417] < (1.417, 2.983]]

In [104]:
pd.value_counts(cats)

(-0.148, 1.417]     470
(-1.714, -0.148]    400
(1.417, 2.983]       81
(-3.286, -1.714]     49
dtype: int64

In [105]:
# 可以自定义分位数(0到1之间的数值，包含端点)

pd.qcut(data, [0, 0.1, 0.5, 0.9, 1.])

[(-0.00813, 1.284], (-1.28, -0.00813], (-1.28, -0.00813], (-3.2809999999999997, -1.28], (-1.28, -0.00813], ..., (1.284, 2.983], (-1.28, -0.00813], (1.284, 2.983], (-1.28, -0.00813], (-1.28, -0.00813]]
Length: 1000
Categories (4, interval[float64]): [(-3.2809999999999997, -1.28] < (-1.28, -0.00813] < (-0.00813, 1.284] < (1.284, 2.983]]

## 7.2.6 检测和过滤异常值

In [106]:
import numpy as np
import pandas as pd

In [111]:
# 过滤或变换异常值(outlier)在很大程序上就是运用数组运算

data = pd.DataFrame(np.random.randn(1000, 4))
data.head()

          0         1         2         3
0 -0.803489 -0.659974  0.389993  1.531615
1  0.086426 -0.203288  1.708249  0.730920
2  1.573922  0.476602  0.150523 -0.383229
3 -0.535995 -2.039900  1.086648 -1.009482
4  1.869813 -0.805773  0.491304  0.605125

In [108]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.001305    -0.005862    -0.021505     0.015008
std       0.952166     0.976110     1.032992     0.994155
min      -3.476073    -3.338651    -3.380600    -3.392566
25%      -0.628981    -0.670082    -0.720474    -0.632177
50%       0.028300    -0.030306    -0.011090     0.026542
75%       0.642111     0.652225     0.663667     0.683618
max       2.962871     3.476787     3.217510     2.948417

In [114]:
# 找出某列中绝对值大小超过3的值

col = data[2]

In [115]:
col[np.abs(col) > 3]

976   -3.23831
Name: 2, dtype: float64

In [116]:
# 等价于：

data[2][np.abs(data[2]) > 3]

976   -3.23831
Name: 2, dtype: float64

In [117]:
# 选出【全部】含有“超过3或-3的值”的行

data[(np.abs(data)>3).any(1)]  # any(1) 等价于 any(axis=1)

            0         1         2         3
94   1.325271 -3.050546  0.075656  0.671798
425 -0.194382 -1.426677  0.641850  3.093184
976  1.897161  2.653926 -3.238310  0.421704

In [118]:
# 将值限制在区间-3到3之间

data[np.abs(data)>3] = np.sign(data) * 3

In [119]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.031972    -0.020185    -0.007286     0.046782
std       0.955071     1.008461     0.980287     0.977778
min      -2.938716    -3.000000    -3.000000    -2.616661
25%      -0.578554    -0.701842    -0.656364    -0.641554
50%       0.019879     0.000468     0.002834     0.051645
75%       0.681954     0.632539     0.678493     0.707700
max       2.631254     2.875750     2.831917     3.000000

In [120]:
# 根据数值的正、负，np.sign(data)可以生成1或-1

np.sign(data).head()

     0    1    2    3
0 -1.0 -1.0  1.0  1.0
1  1.0 -1.0  1.0  1.0
2  1.0  1.0  1.0 -1.0
3 -1.0 -1.0  1.0 -1.0
4  1.0 -1.0  1.0  1.0

### 7.2.7 置换（随机重排序）与随机抽样

In [121]:
import numpy as np
import pandas as pd

In [125]:
# 利用numpy.random.permutation()可以轻松实现对Series或DataFrame的【列】的排列工作(permuting: 随机重排序)
# 通过需要排列的轴的长度调用 permutation, 可产生一个表示新顺序的整数数组

df = pd.DataFrame(np.arange(5 * 4).reshape((5, 4)))
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [124]:
sampler = np.random.permutation(5)
sampler

array([1, 3, 2, 0, 4])

In [126]:
# 然后就可以在基于iloc的索引操作或take()中使用该数组

df.take(sampler)

    0   1   2   3
1   4   5   6   7
3  12  13  14  15
2   8   9  10  11
0   0   1   2   3
4  16  17  18  19

In [127]:
# instance.sample(): 不以替换的方式选取随机子集

df.sample(n=3)

    0   1   2   3
4  16  17  18  19
1   4   5   6   7
3  12  13  14  15

In [128]:
# 通过替换的方式产生样本（允许重复选择），可以传递replace=True到sample

choices = pd.Series([5, 7, -1, 6, 4])

In [129]:
draws = choices.sample(n=10, replace=True)
draws

0    5
2   -1
2   -1
3    6
1    7
3    6
1    7
3    6
1    7
0    5
dtype: int64

## 7.2.8 计算指标/哑变量

In [16]:
import numpy as np
import pandas as pd

In [17]:
# 如果DataFrame的某一列中含有k个不同的值，则可以派生出一个k列矩阵或DataFrame(其值全为0和1)
# 可以 pd.get_dummies() 实现

df = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'b'],
                  'data1': range(6)})
df

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   b      5

In [18]:
pd.get_dummies(df['key'])

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0

In [23]:
# 给指标DataFrame的列加上一个前缀，以便能够跟其他数据进行合并
# 可由 pd.get_dummies() 的 prefix参数 实现

dummies = pd.get_dummies(df['key'], prefix='key')
dummies

   key_a  key_b  key_c
0      0      1      0
1      0      1      0
2      1      0      0
3      0      0      1
4      1      0      0
5      0      1      0

In [24]:
df_with_dummy = df[['data1']].join(dummies)
df_with_dummy

   data1  key_a  key_b  key_c
0      0      0      1      0
1      1      0      1      0
2      2      1      0      0
3      3      0      0      1
4      4      1      0      0
5      5      0      1      0

In [34]:
pd.read_csv('datasets/movielens/movies.dat',sep='::', engine='python', nrows=10)

    1                    Toy Story (1995)   Animation|Children's|Comedy
0   2                      Jumanji (1995)  Adventure|Children's|Fantasy
1   3             Grumpier Old Men (1995)                Comedy|Romance
2   4            Waiting to Exhale (1995)                  Comedy|Drama
3   5  Father of the Bride Part II (1995)                        Comedy
4   6                         Heat (1995)         Action|Crime|Thriller
5   7                      Sabrina (1995)                Comedy|Romance
6   8                 Tom and Huck (1995)          Adventure|Children's
7   9                 Sudden Death (1995)                        Action
8  10                    GoldenEye (1995)     Action|Adventure|Thriller
9  11      American President, The (1995)          Comedy|Drama|Romance

In [35]:
# 如果DataFrame中的某行同属于多个分类，则事情就会有点复杂

mnames = ['movie_id', 'title', 'genres']

In [36]:
movies = pd.read_csv('datasets/movielens/movies.dat',sep='::', 
                       header=None, names=mnames, engine='python')

In [44]:
movies[ : 10]

   movie_id                               title                        genres
0         1                    Toy Story (1995)   Animation|Children's|Comedy
1         2                      Jumanji (1995)  Adventure|Children's|Fantasy
2         3             Grumpier Old Men (1995)                Comedy|Romance
3         4            Waiting to Exhale (1995)                  Comedy|Drama
4         5  Father of the Bride Part II (1995)                        Comedy
5         6                         Heat (1995)         Action|Crime|Thriller
6         7                      Sabrina (1995)                Comedy|Romance
7         8                 Tom and Huck (1995)          Adventure|Children's
8         9                 Sudden Death (1995)                        Action
9        10                    GoldenEye (1995)     Action|Adventure|Thriller

In [45]:
# 要为每个genre添加指标变量，就需要做一些数据两可操作。
# 首先，从数据集中抽取出不同的genre值

all_genres = []

In [46]:
for x in movies.genres:
    all_genres.extend(x.split('|'))

In [47]:
genres = pd.unique(all_genres)

In [48]:
genres

array(['Animation', "Children's", 'Comedy', 'Adventure', 'Fantasy',
       'Romance', 'Drama', 'Action', 'Crime', 'Thriller', 'Horror',
       'Sci-Fi', 'Documentary', 'War', 'Musical', 'Mystery', 'Film-Noir',
       'Western'], dtype=object)

In [54]:
# 构建指标DataFrame的方法之一：从一个全零的DataFrame开始

zero_matrix = np.zeros((len(movies), len(genres)))

In [55]:
dummies = pd.DataFrame(zero_matrix, columns=genres)

In [58]:
# 迭代每一部电影，并将dummies各行的条目设为1
# DataFrame_instance.columns(): 计算每个类型的列索引

gen = movies.genres[0]
gen

"Animation|Children's|Comedy"

In [59]:
gen.split('|')

['Animation', "Children's", 'Comedy']

In [62]:
dummies.columns.get_indexer(gen.split('|'))

array([0, 1, 2], dtype=int64)

In [63]:
# 然后根据索引，使用.iloc设定值

for i, gen in enumerate(movies.genres):
    indices = dummies.columns.get_indexer(gen.split('|'))
    dummies.iloc[i, indices] = 1

In [64]:
# 然后和以前一样，再将其与movies合并起来

movies_windic = movies.join(dummies.add_prefix('Genre_'))

In [65]:
movies_windic.iloc[0]

movie_id                                       1
title                           Toy Story (1995)
genres               Animation|Children's|Comedy
Genre_Animation                                1
Genre_Children's                               1
Genre_Comedy                                   1
Genre_Adventure                                0
Genre_Fantasy                                  0
Genre_Romance                                  0
Genre_Drama                                    0
Genre_Action                                   0
Genre_Crime                                    0
Genre_Thriller                                 0
Genre_Horror                                   0
Genre_Sci-Fi                                   0
Genre_Documentary                              0
Genre_War                                      0
Genre_Musical                                  0
Genre_Mystery                                  0
Genre_Film-Noir                                0
Genre_Western                                  0
Name: 0, dtype: object

In [66]:
# 结合get_dummies()和诸如cut之类的离散化函数

np.random.seed(12345)

In [67]:
values = np.random.rand(10)

In [68]:
values

array([0.92961609, 0.31637555, 0.18391881, 0.20456028, 0.56772503,
       0.5955447 , 0.96451452, 0.6531771 , 0.74890664, 0.65356987])

In [69]:
bins = [0, 0.2, 0.4, 0.6, 0.8, 1]

In [71]:
pd.cut(values, bins)

[(0.8, 1.0], (0.2, 0.4], (0.0, 0.2], (0.2, 0.4], (0.4, 0.6], (0.4, 0.6], (0.8, 1.0], (0.6, 0.8], (0.6, 0.8], (0.6, 0.8]]
Categories (5, interval[float64]): [(0.0, 0.2] < (0.2, 0.4] < (0.4, 0.6] < (0.6, 0.8] < (0.8, 1.0]]

In [72]:
pd.get_dummies(pd.cut(values, bins))

   (0.0, 0.2]  (0.2, 0.4]  (0.4, 0.6]  (0.6, 0.8]  (0.8, 1.0]
0           0           0           0           0           1
1           0           1           0           0           0
2           1           0           0           0           0
3           0           1           0           0           0
4           0           0           1           0           0
5           0           0           1           0           0
6           0           0           0           0           1
7           0           0           0           1           0
8           0           0           0           1           0
9           0           0           0           1           0

# 7.3 字符串操作

## 7.3.1 字符串对象方法

In [73]:
import numpy as np
import pandas as pd

In [74]:
# 以逗号分隔的字符串可以用split拆分成数段

val = 'a, b,    guido'

In [161]:
val.split(',')

['a', ' b', '    guido']

In [162]:
# split常常与strip一起使用，以去除空白符(包括换行符)

pieces = [x.strip() for x in val.split(',')]
pieces

['a', 'b', 'guido']

In [163]:
# str.join(): 连接子字符串

'::'.join(pieces)

'a::b::guido'

In [165]:
# 检测子串

'guido' in val

True

In [166]:
val.index('b')

3

In [168]:
str.find

'a, b,    guido'

In [167]:
val.find(':')

-1

In [170]:
# 返回指定子串的出现次数

val.count(',')

2

In [171]:
# 替换

val.replace(',', '::')

'a:: b::    guido'

In [172]:
val.replace(',', '')

'a b    guido'

In [175]:
%%html
<img src="picture/表7-3 Python 内置的字符串方法.png", width=600>
<img src="picture/表7-3 Python 内置的字符串方法(续).png", width=600>

## 7.3.2 正则表达式

In [177]:
%%html
<img src="picture/表7-4 正则表达式方法.png", width=600>

## 7.3.3 pandas的矢量化字符串函数

In [75]:
import re
import numpy as np
import pandas as pd

In [76]:
data = {'Dave': 'dave@google.com', 'Steve': 'steve@gmail.com',
        'Rob': 'rob@gmail.com', 'Wes': np.nan}

In [77]:
data = pd.Series(data)
data

Dave     dave@google.com
Steve    steve@gmail.com
Rob        rob@gmail.com
Wes                  NaN
dtype: object

In [78]:
data.isnull()

Dave     False
Steve    False
Rob      False
Wes       True
dtype: bool

In [80]:
# 可以通过str.contains()检查是否含有'gmail'

data.str.contains('gmail')

Dave     False
Steve     True
Rob       True
Wes        NaN
dtype: object

In [81]:
# 使用正则表达式

pattern = '([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\\.([A-Z]{2,4})'

In [82]:
data.str.findall(pattern, flags=re.IGNORECASE)  # re.IGNORECASE/ re.I 大小写不敏感

Dave     [(dave, google, com)]
Steve    [(steve, gmail, com)]
Rob        [(rob, gmail, com)]
Wes                        NaN
dtype: object

In [83]:
# 实现适量化的元素获取操作

matches = data.str.match(pattern, flags=re.IGNORECASE)
matches

Dave     True
Steve    True
Rob      True
Wes       NaN
dtype: object

In [84]:
# 要访问嵌入列表中的元素，传递索引

matches.str.get(1)

Dave    NaN
Steve   NaN
Rob     NaN
Wes     NaN
dtype: float64

In [85]:
matches.str[0]

Dave    NaN
Steve   NaN
Rob     NaN
Wes     NaN
dtype: float64

In [231]:
# 截取字符串

data.str[ : 5]

Dave     dave@
Steve    steve
Rob      rob@g
Wes        NaN
dtype: object

In [187]:
%%html
<img src="picture/表7-5 部分矢量化字符串方法.png", width=600>